[
    {
      "id": 1,
      "name": "The Fool",
      "arcana": "Major",
      "meaning_up": "New beginnings, optimism, trust in life",
      "meaning_rev": "Recklessness, taken advantage of, inconsideration",
      "keywords": [
        "beginnings",
        "innocence",
        "free spirit"
      ],
      "description": "The Fool represents new beginnings, spontaneity, and a leap of faith. It symbolizes the start of a journey filled with endless possibilities. Unburdened by experience, The Fool encourages you to trust in the universe and embrace the unknown with optimism.",
      "description_up": "New opportunities, innocence, and a carefree attitude. A time to follow your heart without overthinking. Trusting your instincts can lead to growth and exciting adventures.",
      "description_rev": "Foolishness, naivety, or poor judgment. You may be rushing into something without proper planning or ignoring important red flags. Consider the risks before taking a leap."
    },
    {
      "id": 2,
      "name": "The Magician",
      "arcana": "Major",
      "meaning_up": "Willpower, desire, creation, manifestation",
      "meaning_rev": "Trickery, illusions, out of touch",
      "keywords": [
        "manifestation",
        "resourcefulness",
        "power"
      ],
      "description": "The Magician stands for manifestation, power, and resourcefulness. He uses all tools at his disposal—mind, body, spirit, and emotions—to bring dreams into reality. This card reminds you that you already have everything you need within you.",
      "description_up": "Skill, action, and inspired choices. You’re in a powerful position to create change and turn ideas into tangible results. Use your talents wisely and act with confidence.",
      "description_rev": "Manipulation, deception, or misuse of power. There may be trickery at play, or you’re not using your potential effectively. Check your intentions and ensure you're not leading yourself or others astray."
    },
    {
      "id": 3,
      "name": "The High Priestess",
      "arcana": "Major",
      "meaning_up": "Intuition, unconscious, inner voice",
      "meaning_rev": "Lack of center, lost inner voice, repressed feelings",
      "keywords": [
        "intuition",
        "sacred knowledge",
        "divine feminine"
      ],
      "description": "The High Priestess represents intuition, mystery, and inner knowledge. She is the guardian of subconscious wisdom and hidden truths. This card invites quiet reflection and trust in your inner voice.",
      "description_up": "Intuition, divine feminine energy, and spiritual insight. Now is the time to listen more than speak and observe more than act. Pay attention to your dreams and subtle messages from your environment.",
      "description_rev": "Secrets, disconnection from intuition, or repression. You may be ignoring your inner guidance or refusing to acknowledge what you feel deep down. Create space for stillness and honesty with yourself."
    },
    {
      "id": 4,
      "name": "The Empress",
      "arcana": "Major",
      "meaning_up": "Femininity, beauty, nature, nurturing",
      "meaning_rev": "Dependence, smothering, emptiness",
      "keywords": [
        "fertility",
        "nature",
        "abundance"
      ],
      "description": "The Empress is a symbol of nurturing, abundance, and the beauty of creation. She connects deeply to nature, fertility, and the divine feminine. This card suggests a time of growth and creativity.",
      "description_up": "Nurturing energy, fertility (literal or metaphorical), and emotional fulfillment. Embrace compassion and allow yourself to receive love and abundance. This is a powerful time for artistic or relationship growth.",
      "description_rev": "Dependence, creative blocks, or smothering tendencies. You might be giving too much or not feeling valued. Take time to nourish yourself and examine boundaries in relationships."
    },
    {
      "id": 5,
      "name": "The Emperor",
      "arcana": "Major",
      "meaning_up": "Authority, structure, control, fatherhood",
      "meaning_rev": "Domination, excessive control, rigidity",
      "keywords": [
        "authority",
        "establishment",
        "father figure"
      ],
      "description": "The Emperor represents structure, authority, and control. He is the father figure of the Tarot, embodying leadership, logic, and stability. This card brings a message of protection through discipline and order.",
      "description_up": "Leadership, foundation, and taking control. It's time to assert yourself, set rules, and bring order to chaos. Use rationality and long-term planning to establish stability.",
      "description_rev": "Domination, rigidity, or lack of control. You may be feeling restricted by rules or misusing your authority. Reassess power dynamics and find a healthier approach to leadership."
    },
    {
      "id": 6,
      "name": "The Hierophant",
      "arcana": "Major",
      "meaning_up": "Tradition, conformity, morality",
      "meaning_rev": "Rebellion, subversiveness, new approaches",
      "keywords": [
        "tradition",
        "spiritual wisdom",
        "religious beliefs"
      ],
      "description": "The Hierophant symbolizes tradition, spiritual authority, and societal structures. It often represents a teacher or mentor figure who guides others through established systems or beliefs. This card encourages seeking wisdom through conventional channels.",
      "description_up": "Tradition, conformity, and spiritual guidance. Embrace established systems or seek counsel from a trusted teacher. This may be a time to align with collective values.",
      "description_rev": "Rebellion, nonconformity, or misalignment with societal norms. You might be questioning traditions or authority figures. It’s a sign to explore your own beliefs more deeply."
    },
    {
      "id": 7,
      "name": "The Lovers",
      "arcana": "Major",
      "meaning_up": "Love, harmony, relationships, alignment",
      "meaning_rev": "Disharmony, imbalance, misalignment of values",
      "keywords": [
        "relationships",
        "values alignment",
        "union"
      ],
      "description": "The Lovers card reflects union, partnership, and choices that resonate with the heart. It signifies meaningful relationships and the harmony that comes from authentic connection. Often, it represents a major life decision about values and alignment.",
      "description_up": "Love, alignment, and emotional connection. A time for deep bonds and making choices based on personal truth. Follow what feels right to your soul.",
      "description_rev": "Imbalance, misalignment, or difficult choices. A relationship or decision may be out of sync with your values. Take time to evaluate what truly matters."
    },
    {
      "id": 8,
      "name": "The Chariot",
      "arcana": "Major",
      "meaning_up": "Direction, control, willpower",
      "meaning_rev": "Lack of control, lack of direction, aggression",
      "keywords": [
        "determination",
        "victory",
        "action"
      ],
      "description": "The Chariot stands for determination, control, and willpower. It represents triumph through discipline and focus. This card tells you to stay the course and drive forward with confidence.",
      "description_up": "Victory, control, and ambition. You have the strength to overcome obstacles through focus and discipline. Push forward and claim your success.",
      "description_rev": "Lack of direction, scattered energy, or defeat. You may be struggling to stay on track or forcing control. Recenter and realign your goals before moving forward."
    },
    {
      "id": 9,
      "name": "Strength",
      "arcana": "Major",
      "meaning_up": "Courage, patience, control, compassion",
      "meaning_rev": "Self-doubt, weakness, insecurity",
      "keywords": [
        "bravery",
        "compassion",
        "influence"
      ],
      "description": "Strength represents inner power, patience, and compassion. It emphasizes calm courage over brute force. This card suggests that true power comes from gentle resilience and emotional mastery.",
      "description_up": "Courage, compassion, and resilience. Approach challenges with grace and patience. Trust in your ability to remain grounded through adversity.",
      "description_rev": "Self-doubt, weakness, or emotional overwhelm. You may be lacking confidence or struggling to manage strong feelings. Reconnect with your inner strength."
    },
    {
      "id": 10,
      "name": "The Hermit",
      "arcana": "Major",
      "meaning_up": "Soul-searching, introspection, being alone",
      "meaning_rev": "Isolation, loneliness, withdrawal",
      "keywords": [
        "introspection",
        "solitude",
        "guidance"
      ],
      "description": "The Hermit symbolizes introspection, solitude, and the search for deeper truth. It encourages stepping back from the noise to find clarity. This card points to a time of spiritual growth or self-discovery.",
      "description_up": "Inner guidance, solitude, and reflection. Take time for yourself to reconnect with your path. Answers will come from within.",
      "description_rev": "Isolation, loneliness, or avoidance. You may be retreating too far or resisting connection. Consider if solitude is serving your growth or masking discomfort."
    },
    {
      "id": 11,
      "name": "Wheel of Fortune",
      "arcana": "Major",
      "meaning_up": "Change, cycles, fate, karma",
      "meaning_rev": "No control, clinging to control, bad luck",
      "keywords": [
        "destiny",
        "turning point",
        "movement"
      ],
      "description": "The Wheel of Fortune represents fate, cycles, and change. It reminds you that life is constantly shifting, and the wheel turns in your favor or against you. Be adaptable and trust in the rhythm of life.",
      "description_up": "Luck, destiny, and turning points. Big changes are unfolding, often beyond your control. Stay open to new opportunities and shifts in fortune.",
      "description_rev": "Resistance to change, bad luck, or repeating cycles. You may feel stuck or caught in an unhelpful pattern. Reflect on how to regain agency in your life."
    },
    {
      "id": 12,
      "name": "Justice",
      "arcana": "Major",
      "meaning_up": "Fairness, truth, law",
      "meaning_rev": "Unfairness, lack of accountability, dishonesty",
      "keywords": [
        "truth",
        "law",
        "balance"
      ],
      "description": "Justice is about fairness, truth, and accountability. It calls for balance, integrity, and thoughtful decisions. This card often appears when you must take responsibility or seek what is right.",
      "description_up": "Fairness, truth, and legal matters. Act with integrity and accept the consequences of your actions. Seek clarity and fairness in decision-making.",
      "description_rev": "Injustice, dishonesty, or imbalance. You might be avoiding accountability or facing unfair treatment. Reassess the situation with objectivity."
    },
    {
      "id": 13,
      "name": "The Hanged Man",
      "arcana": "Major",
      "meaning_up": "Sacrifice, release, new perspective",
      "meaning_rev": "Stalling, needless sacrifice, fear of sacrifice",
      "keywords": [
        "pause",
        "surrender",
        "letting go"
      ],
      "description": "The Hanged Man signifies surrender, letting go, and seeing things from a new perspective. It asks you to pause and reflect rather than force action. This card can also indicate a need for spiritual sacrifice.",
      "description_up": "Pause, surrender, and insight. Step back to gain a new understanding. Sometimes waiting is the most powerful move.",
      "description_rev": "Stagnation, resistance, or victim mentality. You may be unwilling to release control. Let go to allow new perspectives to emerge."
    },
    {
      "id": 14,
      "name": "Death",
      "arcana": "Major",
      "meaning_up": "Endings, change, transformation",
      "meaning_rev": "Resistance to change, personal transformation",
      "keywords": [
        "transition",
        "metamorphosis",
        "rebirth"
      ],
      "description": "Death represents transformation, endings, and rebirth. Though it may feel like loss, this card is about profound change and release. It invites you to shed the old and make way for the new.",
      "description_up": "Transformation, closure, and renewal. Let go of what no longer serves you. A powerful cycle is ending, making space for growth.",
      "description_rev": "Resistance to change, stagnation, or fear of endings. You may be clinging to the past. Embrace the natural cycles of transformation."
    },
    {
      "id": 15,
      "name": "Temperance",
      "arcana": "Major",
      "meaning_up": "Balance, moderation, patience",
      "meaning_rev": "Imbalance, excess, extremes",
      "keywords": [
        "harmony",
        "purpose",
        "meaning"
      ],
      "description": "Temperance symbolizes balance, harmony, and moderation. It asks for a blending of opposites and finding your center. This card often appears when you need to restore equilibrium or approach life with patience.",
      "description_up": "Balance, healing, and patience. Move forward with care and integration. A calm and measured approach leads to long-term peace.",
      "description_rev": "Imbalance, excess, or impatience. You might be overdoing something or feeling out of sync. Recalibrate and find your center."
    },
    {
      "id": 16,
      "name": "The Devil",
      "arcana": "Major",
      "meaning_up": "Addiction, materialism, playfulness",
      "meaning_rev": "Freedom, release, restoring control",
      "keywords": [
        "temptation",
        "bondage",
        "shadow self"
      ],
      "description": "The Devil represents temptation, addiction, and materialism. It reflects the chains we willingly accept or the illusions that keep us trapped. This card asks you to confront your shadow and reclaim your power.",
      "description_up": "Bondage, temptation, and shadow work. You may be stuck in unhealthy habits or relationships. Awareness is the first step to freedom.",
      "description_rev": "Liberation, breaking chains, and reclaiming power. You're becoming aware of limiting patterns. It's time to release what holds you back."
    },
    {
      "id": 17,
      "name": "The Tower",
      "arcana": "Major",
      "meaning_up": "Sudden upheaval, chaos, revelation",
      "meaning_rev": "Avoidance of disaster, fear of change",
      "keywords": [
        "disruption",
        "awakening",
        "breakdown"
      ],
      "description": "The Tower symbolizes sudden upheaval, revelation, and the breakdown of false structures. Though it brings chaos, it also clears the way for truth. Expect the unexpected and be open to radical transformation.",
      "description_up": "Sudden change, awakening, and release. Something unstable must fall so truth can emerge. Embrace the destruction as a path to renewal.",
      "description_rev": "Avoidance of change or lingering upheaval. You may be resisting a necessary breakdown. Let go before the universe forces your hand."
    },
    {
      "id": 18,
      "name": "The Star",
      "arcana": "Major",
      "meaning_up": "Hope, faith, purpose, renewal",
      "meaning_rev": "Despair, lack of faith, disconnection",
      "keywords": [
        "inspiration",
        "spirituality",
        "healing"
      ],
      "description": "The Star brings hope, inspiration, and spiritual clarity. It follows the destruction of The Tower and offers healing and peace. This card reminds you that brighter days are ahead.",
      "description_up": "Hope, renewal, and guidance. Trust in your path and let your light shine. You are supported by the universe.",
      "description_rev": "Doubt, despair, or disconnection. You may have lost sight of hope. Reconnect with what inspires you."
    },
    {
      "id": 19,
      "name": "The Moon",
      "arcana": "Major",
      "meaning_up": "Illusion, fear, anxiety, subconscious",
      "meaning_rev": "Release of fear, clarity, understanding",
      "keywords": [
        "intuition",
        "dreams",
        "deception"
      ],
      "description": "The Moon signifies illusion, intuition, and the subconscious. It reveals what lies beneath the surface and encourages inner exploration. Be cautious of confusion or emotional deception.",
      "description_up": "Mystery, dreams, and intuition. Trust your instincts and pay attention to subtle signs. Things are not as they seem.",
      "description_rev": "Clarity, release of fear, or hidden truths revealed. You're beginning to see through illusions. Let light into the shadows."
    },
    {
      "id": 20,
      "name": "The Sun",
      "arcana": "Major",
      "meaning_up": "Positivity, fun, warmth, success",
      "meaning_rev": "Negativity, depression, sadness",
      "keywords": [
        "joy",
        "success",
        "celebration"
      ],
      "description": "The Sun represents joy, vitality, and success. It brings light, warmth, and confidence. This card suggests everything is falling into place and celebrates the beauty of life.",
      "description_up": "Happiness, success, and radiance. You are aligned with your purpose and joyfully expressing yourself. Embrace the moment.",
      "description_rev": "Temporary setbacks, pessimism, or blocked joy. You may not be seeing the positives. Shift your perspective and reconnect with gratitude."
    },
    {
      "id": 21,
      "name": "Judgement",
      "arcana": "Major",
      "meaning_up": "Reflection, reckoning, awakening",
      "meaning_rev": "Lack of self-awareness, doubt, self-loathing",
      "keywords": [
        "absolution",
        "inner calling",
        "rebirth"
      ],
      "description": " Judgement speaks to rebirth, evaluation, and higher calling. It marks a time of awakening or self-assessment. This card invites reflection on your path and a decision to evolve.",
      "description_up": "Awakening, accountability, and renewal. You're being called to rise and transform. Let go of guilt and step into your purpose.",
      "description_rev": "Self-doubt, regret, or fear of change. You may be avoiding a reckoning. Take responsibility and allow healing."
    },
    {
      "id": 22,
      "name": "The World",
      "arcana": "Major",
      "meaning_up": "Completion, achievement, travel",
      "meaning_rev": "Short cuts, delays, lack of closure",
      "keywords": [
        "wholeness",
        "accomplishment",
        "integration"
      ],
      "description": "The World signifies completion, accomplishment, and wholeness. It marks the end of a journey and the start of a new one. This card celebrates integration and global understanding.",
      "description_up": "Fulfillment, success, and unity. You’ve reached a milestone and are ready for what’s next. Honor how far you've come.",
      "description_rev": "Incomplete cycles, delays, or lack of closure. Something may still be unresolved. Revisit loose ends before moving forward."
    },
    {
      "id": 23,
      "name": "Ace of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 1,
      "meaning_up": "Beginnings, potential in emotions and relationships",
      "meaning_rev": "Reversed beginnings, potential in emotions and relationships",
      "keywords": [
        "beginnings, potential",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 24,
      "name": "Two of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 2,
      "meaning_up": "Balance, duality in emotions and relationships",
      "meaning_rev": "Reversed balance, duality in emotions and relationships",
      "keywords": [
        "balance, duality",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 25,
      "name": "Three of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 3,
      "meaning_up": "Growth, creativity in emotions and relationships",
      "meaning_rev": "Reversed growth, creativity in emotions and relationships",
      "keywords": [
        "growth, creativity",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 26,
      "name": "Four of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 4,
      "meaning_up": "Stability, structure in emotions and relationships",
      "meaning_rev": "Reversed stability, structure in emotions and relationships",
      "keywords": [
        "stability, structure",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 27,
      "name": "Five of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 5,
      "meaning_up": "Conflict, change in emotions and relationships",
      "meaning_rev": "Reversed conflict, change in emotions and relationships",
      "keywords": [
        "conflict, change",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 28,
      "name": "Six of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 6,
      "meaning_up": "Harmony, cooperation in emotions and relationships",
      "meaning_rev": "Reversed harmony, cooperation in emotions and relationships",
      "keywords": [
        "harmony, cooperation",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 29,
      "name": "Seven of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 7,
      "meaning_up": "Reflection, assessment in emotions and relationships",
      "meaning_rev": "Reversed reflection, assessment in emotions and relationships",
      "keywords": [
        "reflection, assessment",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 30,
      "name": "Eight of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 8,
      "meaning_up": "Movement, change in emotions and relationships",
      "meaning_rev": "Reversed movement, change in emotions and relationships",
      "keywords": [
        "movement, change",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 31,
      "name": "Nine of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 9,
      "meaning_up": "Fruition, attainment in emotions and relationships",
      "meaning_rev": "Reversed fruition, attainment in emotions and relationships",
      "keywords": [
        "fruition, attainment",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 32,
      "name": "Ten of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 10,
      "meaning_up": "Completion, fulfillment in emotions and relationships",
      "meaning_rev": "Reversed completion, fulfillment in emotions and relationships",
      "keywords": [
        "completion, fulfillment",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 33,
      "name": "Page of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 11,
      "meaning_up": "Curiosity, new stage expressed through emotions and relationships",
      "meaning_rev": "Reversed curiosity, new stage in emotions and relationships",
      "keywords": [
        "curiosity, new stage",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 34,
      "name": "Knight of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 12,
      "meaning_up": "Action, pursuit expressed through emotions and relationships",
      "meaning_rev": "Reversed action, pursuit in emotions and relationships",
      "keywords": [
        "action, pursuit",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 35,
      "name": "Queen of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 13,
      "meaning_up": "Understanding, mastery expressed through emotions and relationships",
      "meaning_rev": "Reversed understanding, mastery in emotions and relationships",
      "keywords": [
        "understanding, mastery",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 36,
      "name": "King of Cups",
      "arcana": "Minor",
      "suit": "Cups",
      "number": 14,
      "meaning_up": "Authority, control expressed through emotions and relationships",
      "meaning_rev": "Reversed authority, control in emotions and relationships",
      "keywords": [
        "authority, control",
        "emotions",
        "cups"
      ],
      "description": "",
      "description_up": "",
      "description_rev": ""
    },
    {
      "id": 37,
      "name": "Ace of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 1,
      "meaning_up": "Beginnings, potential in material aspects and career",
      "meaning_rev": "Reversed beginnings, potential in material aspects and career",
      "keywords": [
        "beginnings, potential",
        "material",
        "pentacles"
      ],
      "description": "The Ace of Pentacles symbolizes new beginnings in the material world—financial opportunities, career prospects, or tangible rewards. It represents the seed of prosperity being planted. This card encourages you to pursue your goals with practicality and focus, as abundance is within reach.",
      "description_up": "Financial gain, new ventures, or career developments. A strong foundation is being laid, and with effort, long-term success can follow. It’s a time to take concrete steps toward building your future.",
      "description_rev": "Missed opportunities, instability, or poor planning. You might be ignoring practical needs or facing delays in your financial or career goals. Be cautious of false promises or hasty investments."
    },
    {
      "id": 38,
      "name": "Two of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 2,
      "meaning_up": "Balance, duality in material aspects and career",
      "meaning_rev": "Reversed balance, duality in material aspects and career",
      "keywords": [
        "balance, duality",
        "material",
        "pentacles"
      ],
      "description": "The Two of Pentacles reflects balance, adaptability, and juggling responsibilities. It often indicates the need to manage multiple priorities without losing focus. This card reminds you to remain flexible and maintain harmony in the face of change.",
      "description_up": "Time management, adaptability, and resourcefulness. You are effectively balancing your work and personal life, even if things feel hectic. Flexibility and organization are key to maintaining this balance.",
      "description_rev": "Overwhelm, disorganization, or financial imbalance. You may be struggling to keep up with demands, leading to stress and instability. Take time to reassess your priorities before burnout sets in."
    },
    {
      "id": 39,
      "name": "Three of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 3,
      "meaning_up": "Growth, creativity in material aspects and career",
      "meaning_rev": "Reversed growth, creativity in material aspects and career",
      "keywords": [
        "growth, creativity",
        "material",
        "pentacles"
      ],
      "description": "The Three of Pentacles represents teamwork, collaboration, and skilled effort. It suggests that your goals will benefit from working with others and recognizing each person’s contribution. This card emphasizes craftsmanship and the importance of planning.",
      "description_up": "Collaboration, recognition, and shared goals. Your hard work is being noticed, and you’re making progress through cooperation. It’s a good time to align with others who bring complementary skills.",
      "description_rev": "Miscommunication, lack of cooperation, or feeling undervalued. You may be working in isolation or dealing with unproductive group dynamics. Reevaluate the team's structure and clarify expectations."
    },
    {
      "id": 40,
      "name": "Four of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 4,
      "meaning_up": "Stability, structure in material aspects and career",
      "meaning_rev": "Reversed stability, structure in material aspects and career",
      "keywords": [
        "stability, structure",
        "material",
        "pentacles"
      ],
      "description": " The Four of Pentacles signals a desire for control, security, and holding tightly to possessions or resources. It often highlights financial stability but can also point to fear of loss or change. While it’s good to be cautious, excessive rigidity can block growth.",
      "description_up": "Financial security, saving, and control. You may be building a stable foundation and protecting your assets wisely. However, consider whether your attachment to stability is limiting other areas of your life.",
      "description_rev": "Greed, insecurity, or release of control. You might be clinging too tightly to money or resisting necessary changes. This is a prompt to loosen your grip and allow more flow into your life."
    },
    {
      "id": 41,
      "name": "Five of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 5,
      "meaning_up": "Conflict, change in material aspects and career",
      "meaning_rev": "Reversed conflict, change in material aspects and career",
      "keywords": [
        "conflict, change",
        "material",
        "pentacles"
      ],
      "description": "The Five of Pentacles represents hardship, financial loss, or feeling left out in the cold. It points to a period of struggle that may affect your confidence and sense of belonging. This card reminds you that help is available if you're willing to seek it.",
      "description_up": "Financial difficulty, isolation, and low self-worth. You may be facing tough times, but support is closer than you think. Don’t let pride prevent you from reaching out.",
      "description_rev": "Recovery, improvement, or renewed hope. You are beginning to find your way out of hardship. Keep your focus on the progress you're making, however small it may seem."
    },
    {
      "id": 42,
      "name": "Six of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 6,
      "meaning_up": "Harmony, cooperation in material aspects and career",
      "meaning_rev": "Reversed harmony, cooperation in material aspects and career",
      "keywords": [
        "harmony, cooperation",
        "material",
        "pentacles"
      ],
      "description": "The Six of Pentacles is about generosity, giving and receiving, and financial balance. It reflects the importance of both charity and humility, and can signify a time when you either offer help or are open to receiving it. The card suggests mutual support and fairness in relationships or finances.",
      "description_up": "Generosity, charity, and fairness. You may find yourself in a position to help others or receive assistance from someone generous. Giving and receiving are both part of a healthy cycle—practice gratitude in either role.",
      "description_rev": "One-sided charity, strings attached, or inequality. You may feel undervalued, exploited, or burdened by someone else's expectations. Examine your motives and ensure your exchanges are rooted in balance and respect."
    },
    {
      "id": 43,
      "name": "Seven of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 7,
      "meaning_up": "Reflection, assessment in material aspects and career",
      "meaning_rev": "Reversed reflection, assessment in material aspects and career",
      "keywords": [
        "reflection, assessment",
        "material",
        "pentacles"
      ],
      "description": "The Seven of Pentacles symbolizes patience, long-term vision, and steady progress. It suggests a pause to reflect on your efforts and consider future rewards. This card encourages persistence and reevaluation of goals to ensure sustainable success.",
      "description_up": "Reflection, investment, and delayed gratification. Your hard work is beginning to show results, but the biggest rewards are still ahead. Take this time to assess what’s working and what needs adjustment.",
      "description_rev": "Impatience, wasted effort, or lack of reward. You may be frustrated with slow progress or investing in something that’s not yielding results. Reconsider your strategy and make necessary changes."
    },
    {
      "id": 44,
      "name": "Eight of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 8,
      "meaning_up": "Movement, change in material aspects and career",
      "meaning_rev": "Reversed movement, change in material aspects and career",
      "keywords": [
        "movement, change",
        "material",
        "pentacles"
      ],
      "description": "The Eight of Pentacles highlights dedication, skill development, and mastery through hard work. It represents learning, craftsmanship, and the pursuit of excellence. This card suggests progress through focused, consistent effort.",
      "description_up": "Apprenticeship, diligence, and growth. You are fully committed to improving your skills and building something meaningful. Stay the course—your efforts will pay off over time.",
      "description_rev": " Laziness, burnout, or lack of focus. You might be cutting corners or feeling disinterested in your work. Consider whether your heart is still in it and what needs to be reignited."
    },
    {
      "id": 45,
      "name": "Nine of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 9,
      "meaning_up": "Fruition, attainment in material aspects and career",
      "meaning_rev": "Reversed fruition, attainment in material aspects and career",
      "keywords": [
        "fruition, attainment",
        "material",
        "pentacles"
      ],
      "description": "The Nine of Pentacles symbolizes independence, self-sufficiency, and material comfort. It reflects success earned through discipline and wise choices. This card suggests enjoying the fruits of your labor and a moment of personal pride.",
      "description_up": "Luxury, confidence, and independence. You’ve built a stable life through hard work, and now it's time to enjoy it. Appreciate the freedom and comfort you've earned.",
      "description_rev": "Over-dependence, superficial success, or insecurity. You may be chasing material things without inner fulfillment. Reconnect with what truly brings you satisfaction beyond wealth."
    },
    {
      "id": 46,
      "name": "Ten of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 10,
      "meaning_up": "Completion, fulfillment in material aspects and career",
      "meaning_rev": "Reversed completion, fulfillment in material aspects and career",
      "keywords": [
        "completion, fulfillment",
        "material",
        "pentacles"
      ],
      "description": "The Ten of Pentacles represents legacy, long-term wealth, and family stability. It indicates financial security built over time and the passing down of traditions or values. This card suggests a lasting foundation for future generations.",
      "description_up": "Family wealth, tradition, and lasting success. Your work has created a strong, supportive network or legacy. This is a time to enjoy stability and plan for the long term.",
      "description_rev": "Financial instability, family conflict, or short-sightedness. You may be experiencing disruption in long-term plans or family dynamics. Reassess your goals and seek harmony in your foundations."
    },
    {
      "id": 47,
      "name": "Page of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 11,
      "meaning_up": "Curiosity, new stage expressed through material aspects and career",
      "meaning_rev": "Reversed curiosity, new stage in material aspects and career",
      "keywords": [
        "curiosity, new stage",
        "material",
        "pentacles"
      ],
      "description": "The Page of Pentacles is the student and the dreamer of the suit. It represents new opportunities in learning, work, or finances, and the energy of curiosity and ambition. This card suggests setting plans in motion and being open to growth.",
      "description_up": "Study, opportunity, and grounded ambition. You’re in the early stages of a project or learning process, ready to plant the seeds of success. Stay curious and committed.",
      "description_rev": "Procrastination, lack of direction, or missed chances. You may be unfocused or failing to act on potential. Refocus your energy and start building momentum."
    },
    {
      "id": 48,
      "name": "Knight of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 12,
      "meaning_up": "Action, pursuit expressed through material aspects and career",
      "meaning_rev": "Reversed action, pursuit in material aspects and career",
      "keywords": [
        "action, pursuit",
        "material",
        "pentacles"
      ],
      "description": "The Knight of Pentacles represents hard work, responsibility, and a methodical approach. He is reliable and steady, often symbolizing the grind required to reach a goal. This card encourages persistence and loyalty to your path.",
      "description_up": "Routine, responsibility, and dedication. Your patience and effort are your greatest strengths now. Stay consistent and keep moving forward, even if progress is slow.",
      "description_rev": "Stagnation, boredom, or workaholism. You might be stuck in a rut or overly fixated on control. Try to balance discipline with flexibility and inspiration."
    },
    {
      "id": 49,
      "name": "Queen of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 13,
      "meaning_up": "Understanding, mastery expressed through material aspects and career",
      "meaning_rev": "Reversed understanding, mastery in material aspects and career",
      "keywords": [
        "understanding, mastery",
        "material",
        "pentacles"
      ],
      "description": "The Queen of Pentacles is nurturing, grounded, and resourceful. She blends the practical with the loving, creating a home filled with warmth and abundance. This card represents financial stability alongside care for others.",
      "description_up": "Practicality, nurturing, and domestic harmony. You’re capable of providing for yourself and those around you. Focus on creating balance between work, home, and self-care.",
      "description_rev": "Imbalance, neglect, or insecurity. You may be overextending yourself or losing sight of your needs. Reinvest energy in your own well-being and boundaries."
    },
    {
      "id": 50,
      "name": "King of Pentacles",
      "arcana": "Minor",
      "suit": "Pentacles",
      "number": 14,
      "meaning_up": "Authority, control expressed through material aspects and career",
      "meaning_rev": "Reversed authority, control in material aspects and career",
      "keywords": [
        "authority, control",
        "material",
        "pentacles"
      ],
      "description": "The King of Pentacles stands for wealth, leadership, and mastery in the material world. He represents someone who has built success through discipline and smart choices. This card signals security and the power to support others.",
      "description_up": "Financial success, leadership, and reliability. You’ve reached a point of stability where you can share your resources and guide others. Lead with wisdom and responsibility.",
      "description_rev": "Greed, rigidity, or misuse of power. You may be clinging to status or resisting change. True leadership requires generosity, not control."
    },
    {
      "id": 51,
      "name": "Ace of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 1,
      "meaning_up": "Beginnings, potential in intellect and conflict",
      "meaning_rev": "Reversed beginnings, potential in intellect and conflict",
      "keywords": [
        "beginnings, potential",
        "intellect",
        "swords"
      ],
      "description": "The Ace of Swords symbolizes clarity, truth, and new ideas. It marks a breakthrough or a moment of mental clarity that cuts through confusion. This card invites you to embrace logic and justice when approaching challenges. It’s a powerful sign of mental force and intellectual potential.",
      "description_up": "A fresh start mentally, a breakthrough, or a moment of epiphany. You are ready to face the truth and express your ideas with clarity and honesty. Now is the time to cut through confusion and communicate with confidence. Success is possible through a sharp mind and clear intentions.",
      "description_rev": "Confusion, misinformation, or clouded judgment. You may be struggling to see the truth or being misled by unclear thoughts or communication. This card can warn against using intellect as a weapon or being too harsh in your judgment. Take time to reflect before making important decisions."
    },
    {
      "id": 52,
      "name": "Two of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 2,
      "meaning_up": "Balance, duality in intellect and conflict",
      "meaning_rev": "Reversed balance, duality in intellect and conflict",
      "keywords": [
        "balance, duality",
        "intellect",
        "swords"
      ],
      "description": "The Two of Swords represents a stalemate, indecision, or difficult choices. It often appears when you're torn between two options or avoiding a decision altogether. This card suggests a need for inner clarity before moving forward. Blindfolded, you must trust your intuition when facts alone don’t suffice.",
      "description_up": "You may be at a crossroads, needing to make a tough decision. It's important to find balance and weigh both sides carefully. Avoidance will only delay progress, so it’s time to remove the blindfold and choose a path. Trust your inner voice to help you break the deadlock.",
      "description_rev": "Overwhelm, confusion, or being paralyzed by indecision. You may be avoiding the truth or struggling to confront something emotionally difficult. This card can indicate a refusal to see things as they are or a fear of conflict. Gaining perspective and confronting your fears can help bring resolution."
    },
    {
      "id": 53,
      "name": "Three of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 3,
      "meaning_up": "Growth, creativity in intellect and conflict",
      "meaning_rev": "Reversed growth, creativity in intellect and conflict",
      "keywords": [
        "growth, creativity",
        "intellect",
        "swords"
      ],
      "description": "The Three of Swords represents heartbreak, sorrow, and emotional pain. It often appears when you're experiencing loss or betrayal. This card speaks to the sharp sting of grief and the need to acknowledge and process your emotions. While painful, this moment is also an opportunity for healing and clarity.",
      "description_up": "Emotional wounds, heartbreak, or disappointment. You may be going through a breakup, separation, or betrayal that cuts deeply. Though the pain is real, it offers a chance for inner growth and understanding. Honest acknowledgment of your feelings is the first step toward healing.",
      "description_rev": "Lingering pain, suppressed emotions, or denial of grief. You may be resisting the healing process or trying to move on too quickly. This card suggests the need to confront unresolved hurt. Give yourself permission to feel and release the emotional weight you carry."
    },
    {
      "id": 54,
      "name": "Four of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 4,
      "meaning_up": "Stability, structure in intellect and conflict",
      "meaning_rev": "Reversed stability, structure in intellect and conflict",
      "keywords": [
        "stability, structure",
        "intellect",
        "swords"
      ],
      "description": "The Four of Swords symbolizes rest, recovery, and mental stillness. After a period of stress or conflict, it signals the need for pause and reflection. This card invites you to take a step back and regain strength before continuing forward. It’s a reminder that rest is an essential part of any journey.",
      "description_up": "Rest, meditation, and retreat are necessary for renewal. You’ve been through a lot, and now is the time to heal and regroup. Allow space for stillness and clarity before reengaging with challenges. Recharging your mental and emotional energy will help restore balance.",
      "description_rev": "Burnout, restlessness, or avoiding needed recovery. You may be pushing yourself too hard or ignoring your need for rest. This card warns of physical or emotional exhaustion if you don't slow down. Prioritize self-care before it becomes a forced necessity."
    },
    {
      "id": 55,
      "name": "Five of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 5,
      "meaning_up": "Conflict, change in intellect and conflict",
      "meaning_rev": "Reversed conflict, change in intellect and conflict",
      "keywords": [
        "conflict, change",
        "intellect",
        "swords"
      ],
      "description": "The Five of Swords reflects conflict, tension, and hollow victories. It often appears when disagreements escalate or someone acts out of self-interest. This card asks you to consider whether winning is worth the cost. It’s a moment to reflect on pride, communication, and the aftermath of conflict.",
      "description_up": "Victory at the expense of others, arguments, or betrayal. You may feel the need to prove a point, but it could damage relationships in the process. This card invites you to evaluate your motives and the emotional toll of your actions. Sometimes, walking away preserves more than winning does",
      "description_rev": "Resolution, forgiveness, or letting go of conflict. You may be ready to move past a disagreement or clear the air with someone. This card encourages a shift away from ego and toward mutual understanding. Peace comes through compromise and emotional maturity."
    },
    {
      "id": 56,
      "name": "Six of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 6,
      "meaning_up": "Harmony, cooperation in intellect and conflict",
      "meaning_rev": "Reversed harmony, cooperation in intellect and conflict",
      "keywords": [
        "harmony, cooperation",
        "intellect",
        "swords"
      ],
      "description": "The Six of Swords represents transition, healing, and moving away from difficulties. It often appears when you're leaving behind pain or struggle and heading toward calmer waters. Though the journey may be emotional, this card offers hope for a better future. It’s a symbol of progress and the strength to carry on.",
      "description_up": "You are moving on from a difficult situation, mentally or emotionally. This may be a literal journey or a symbolic shift toward peace. The healing process has begun, and although it may be slow, it is steady. Trust in the transition and allow yourself to release the past.",
      "description_rev": "Resistance to change, unresolved issues, or emotional baggage. You may be holding onto pain or afraid to let go of the past. This card urges you to face what’s holding you back and choose growth. Without release, true healing cannot occur."
    },
    {
      "id": 57,
      "name": "Seven of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 7,
      "meaning_up": "Reflection, assessment in intellect and conflict",
      "meaning_rev": "Reversed reflection, assessment in intellect and conflict",
      "keywords": [
        "reflection, assessment",
        "intellect",
        "swords"
      ],
      "description": "The Seven of Swords represents deception, strategy, and hidden motives. It suggests someone is acting with secrecy or avoiding full disclosure. This card can reflect either cunning strategy or dishonest behavior. It’s a call to examine trust, intentions, and personal integrity.",
      "description_up": "Strategic thinking, stealth, or doing what’s necessary to get ahead. You might be keeping plans to yourself or working behind the scenes. In some cases, this card warns against dishonesty or manipulation. Proceed with awareness and ensure your actions align with your values.",
      "description_rev": "Being caught, guilt, or coming clean. Secrets may be revealed, or you may feel the weight of dishonest actions. This card encourages honesty and taking accountability for past choices. It’s time to reassess your strategies and act with greater transparency."
    },
    {
      "id": 58,
      "name": "Eight of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 8,
      "meaning_up": "Movement, change in intellect and conflict",
      "meaning_rev": "Reversed movement, change in intellect and conflict",
      "keywords": [
        "movement, change",
        "intellect",
        "swords"
      ],
      "description": "The Eight of Swords represents feeling trapped, restricted, or powerless. It often reflects a mental prison created by fear and self-doubt. Though you may feel stuck, the limitations are often internal, not external. This card urges you to challenge negative thoughts and reclaim your agency.",
      "description_up": "Self-imposed limitations, fear, and feeling stuck. You may be overwhelmed by anxiety or a lack of clarity, unable to see a way out. This card asks you to look beyond fear and realize that freedom is possible. Clarity and empowerment come from shifting your mindset.",
      "description_rev": "Release, breakthrough, or clarity. You’re beginning to see the mental patterns or beliefs that have held you back. There is an opportunity to break free from negative thought cycles. You now have the awareness and strength to move forward."
    },
    {
      "id": 59,
      "name": "Nine of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 9,
      "meaning_up": "Fruition, attainment in intellect and conflict",
      "meaning_rev": "Reversed fruition, attainment in intellect and conflict",
      "keywords": [
        "fruition, attainment",
        "intellect",
        "swords"
      ],
      "description": "The Nine of Swords signifies anxiety, nightmares, and inner turmoil. It reflects a period of mental anguish or excessive worry. This card often arises when fears feel all-consuming, especially at night. It’s a reminder to seek support and confront your inner shadows with compassion.",
      "description_up": "Anxiety, regret, or insomnia caused by unresolved fears. You may be trapped in a cycle of worry, imagining worst-case scenarios. This card urges you to examine the source of your fear and question its reality. Healing begins with facing the truth and showing yourself kindness.",
      "description_rev": "Recovery, easing anxiety, or emotional release. You are beginning to come out of a dark emotional time. This card may indicate seeking help or gaining new perspective. Relief is possible when you acknowledge and share your burdens."
    },
    {
      "id": 60,
      "name": "Ten of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 10,
      "meaning_up": "Completion, fulfillment in intellect and conflict",
      "meaning_rev": "Reversed completion, fulfillment in intellect and conflict",
      "keywords": [
        "completion, fulfillment",
        "intellect",
        "swords"
      ],
      "description": "The Ten of Swords symbolizes endings, betrayal, and hitting rock bottom. It often marks a painful conclusion or a dramatic shift. While this card can feel harsh, it also signifies that the worst is over. From this low point, healing and new beginnings are possible.",
      "description_up": "Defeat, loss, or betrayal that brings closure. You may be experiencing a significant setback or emotional pain. While the moment is difficult, it clears the path for renewal. Let go of what no longer serves and focus on your recovery.",
      "description_rev": "Healing, survival, and resilience. You’re beginning to rise after a tough chapter, wiser and stronger. This card invites you to release lingering pain and rebuild your strength. Embrace the lessons learned and move toward a brighter future."
    },
    {
      "id": 61,
      "name": "Page of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 11,
      "meaning_up": "Curiosity, new stage expressed through intellect and conflict",
      "meaning_rev": "Reversed curiosity, new stage in intellect and conflict",
      "keywords": [
        "curiosity, new stage",
        "intellect",
        "swords"
      ],
      "description": "The Page of Swords represents curiosity, mental energy, and communication. This card suggests an eagerness to learn, observe, and explore ideas. It can signify a new intellectual pursuit or the need to speak your truth. Be alert and open-minded as you navigate new thoughts and perspectives.",
      "description_up": "Intellectual enthusiasm, new ideas, and honest communication. You may be learning something new or standing up for your beliefs. This card encourages curiosity and mental clarity. Stay sharp and be ready to gather and share important information.",
      "description_rev": "Gossip, misinformation, or impulsive words. You may be speaking without thinking or spreading ideas without proof. This card warns against being too hasty or confrontational. Think before you speak and seek truth over drama."
    },
    {
      "id": 62,
      "name": "Knight of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 12,
      "meaning_up": "Action, pursuit expressed through intellect and conflict",
      "meaning_rev": "Reversed action, pursuit in intellect and conflict",
      "keywords": [
        "action, pursuit",
        "intellect",
        "swords"
      ],
      "description": "The Knight of Swords charges forward with ambition, determination, and sharp intellect. He represents swift action and fearless pursuit of goals. While bold and focused, he can be reckless if not mindful. This card calls for courage, but also clarity and self-awareness.",
      "description_up": "Driven, focused, and ready to act. You are pursuing your goals with passion and mental strength. This is a time to be brave, but avoid steamrolling others in your quest. Stay sharp and channel your energy wisely.",
      "description_rev": "Impulsiveness, aggression, or lack of direction. You may be rushing without fully understanding your purpose. This card advises slowing down and reassessing your motivations. Act with both intellect and heart to avoid unintended consequences."
    },
    {
      "id": 63,
      "name": "Queen of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 13,
      "meaning_up": "Understanding, mastery expressed through intellect and conflict",
      "meaning_rev": "Reversed understanding, mastery in intellect and conflict",
      "keywords": [
        "understanding, mastery",
        "intellect",
        "swords"
      ],
      "description": "The Queen of Swords embodies wisdom, independence, and perceptiveness. She speaks the truth and sees through illusions. This card calls you to embrace clarity and honesty, especially in communication. Her strength lies in intellect balanced with maturity and discernment.",
      "description_up": "Clear thinking, honesty, and setting strong boundaries. You are being called to speak your truth with compassion and authority. This card supports logic and emotional maturity. Use your experiences to guide others and protect your peace.",
      "description_rev": "Coldness, bitterness, or overcritical thinking. You may be shutting others out or being overly harsh. This card suggests finding a balance between reason and empathy. Healing comes from softening your stance and allowing connection."
    },
    {
      "id": 64,
      "name": "King of Swords",
      "arcana": "Minor",
      "suit": "Swords",
      "number": 14,
      "meaning_up": "Authority, control expressed through intellect and conflict",
      "meaning_rev": "Reversed authority, control in intellect and conflict",
      "keywords": [
        "authority, control",
        "intellect",
        "swords"
      ],
      "description": "The King of Swords represents authority, intellect, and truth. He rules with fairness and logic, offering clarity in complex matters. This card signifies strong leadership and ethical decision-making. You are called to lead with wisdom and integrity.",
      "description_up": "Rational thinking, clear judgment, and intellectual strength. You may be in a position of authority or offering wise counsel. This card encourages fair, objective, and ethical decisions. Trust in logic, but don’t lose sight of humanity.",
      "description_rev": "Manipulation, misuse of power, or emotional detachment. You may be too controlling or using knowledge in a harmful way. This card warns against arrogance and lack of empathy. Reevaluate how you use your influence and reconnect with integrity."
    },
    {
      "id": 65,
      "name": "Ace of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 1,
      "meaning_up": "Beginnings, potential in inspiration and willpower",
      "meaning_rev": "Reversed beginnings, potential in inspiration and willpower",
      "keywords": [
        "beginnings, potential",
        "inspiration",
        "wands"
      ],
      "description": "The Ace of Wands represents inspiration, new opportunities, and the spark of passion. It’s a card of action and enthusiasm, signaling the beginning of a creative venture or personal growth. This is a powerful moment to pursue your desires and plant new seeds.",
      "description_up": "New beginnings, inspiration, and motivation. A creative fire is lit, urging you to act boldly. Say yes to what excites you.",
      "description_rev": "Delays, lack of direction, or creative blocks. Your passion may be stifled or misdirected. Reconnect with your core desire before moving forward."
    },
    {
      "id": 66,
      "name": "Two of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 2,
      "meaning_up": "Balance, duality in inspiration and willpower",
      "meaning_rev": "Reversed balance, duality in inspiration and willpower",
      "keywords": [
        "balance, duality",
        "inspiration",
        "wands"
      ],
      "description": "The Two of Wands signifies planning, foresight, and exploring new possibilities. You’ve achieved something and now look toward expanding or embarking on a new path. It’s a time to weigh your options and envision your future.",
      "description_up": "Vision, planning, and choices. Look beyond your current situation to what could be. Make decisions with boldness and clarity.",
      "description_rev": "Fear of change, indecision, or lack of progress. You may be hesitating to move forward. Reflect on what’s holding you back from expansion."
    },
    {
      "id": 67,
      "name": "Three of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 3,
      "meaning_up": "Growth, creativity in inspiration and willpower",
      "meaning_rev": "Reversed growth, creativity in inspiration and willpower",
      "keywords": [
        "growth, creativity",
        "inspiration",
        "wands"
      ],
      "description": "The Three of Wands represents expansion, progress, and long-term vision. Your plans are in motion, and results are beginning to take shape. This card encourages confidence in your journey and looking ahead with optimism.",
      "description_up": "Progress, foresight, and opportunities. Your efforts are paying off and the horizon is bright. Keep your sights set on long-term goals.",
      "description_rev": "Obstacles, frustration, or stalled momentum. You may be struggling to see returns or unsure of your path. Adjust your plan or stay patient."
    },
    {
      "id": 68,
      "name": "Four of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 4,
      "meaning_up": "Stability, structure in inspiration and willpower",
      "meaning_rev": "Reversed stability, structure in inspiration and willpower",
      "keywords": [
        "stability, structure",
        "inspiration",
        "wands"
      ],
      "description": "The Four of Wands symbolizes celebration, homecoming, and harmony. It often marks milestones like weddings, reunions, or achievements. This card is a joyful reminder of stability and shared happiness.",
      "description_up": "Celebration, community, and stability. It’s time to enjoy the fruits of your labor with loved ones. Honor the moment and your growth.",
      "description_rev": "Instability, conflict, or feeling left out. There may be tension around home or relationships. Focus on rebuilding a sense of harmony."
    },
    {
      "id": 69,
      "name": "Five of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 5,
      "meaning_up": "Conflict, change in inspiration and willpower",
      "meaning_rev": "Reversed conflict, change in inspiration and willpower",
      "keywords": [
        "conflict, change",
        "inspiration",
        "wands"
      ],
      "description": "The Five of Wands suggests competition, conflict, or scattered energy. You may be facing challenges or differing opinions. While it can be chaotic, this energy can also fuel growth and assertiveness.",
      "description_up": "Conflict, tension, and competition. You’re being tested or challenged—stay grounded. Use this as an opportunity to prove your resilience.",
      "description_rev": "Avoidance of conflict or inner tension. You might be suppressing disagreement or unsure how to proceed. Seek clarity and resolve disputes constructively."
    },
    {
      "id": 70,
      "name": "Six of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 6,
      "meaning_up": "Harmony, cooperation in inspiration and willpower",
      "meaning_rev": "Reversed harmony, cooperation in inspiration and willpower",
      "keywords": [
        "harmony, cooperation",
        "inspiration",
        "wands"
      ],
      "description": "The Six of Wands is a card of victory, recognition, and success. After a period of effort, you’re receiving appreciation and support. It’s a time of public validation and shared pride.",
      "description_up": "Victory, acknowledgment, and confidence. You’re being seen and celebrated for your achievements. Enjoy the spotlight and keep moving forward.",
      "description_rev": "Self-doubt, lack of recognition, or pride issues. You may feel overlooked or unappreciated. Reflect on your motivations and stay humble."
    },
    {
      "id": 71,
      "name": "Seven of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 7,
      "meaning_up": "Reflection, assessment in inspiration and willpower",
      "meaning_rev": "Reversed reflection, assessment in inspiration and willpower",
      "keywords": [
        "reflection, assessment",
        "inspiration",
        "wands"
      ],
      "description": "The Seven of Wands signifies defense, perseverance, and standing your ground. You may be facing opposition or challenges, but you have the strength to hold firm. Protect your values and push forward with courage.",
      "description_up": "Defense, persistence, and conviction. Stand tall and stay firm in your beliefs. Your position is worth protecting.",
      "description_rev": "Overwhelm, giving up, or defensiveness. You might feel outnumbered or exhausted. Choose your battles and recharge when needed."
    },
    {
      "id": 72,
      "name": "Eight of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 8,
      "meaning_up": "Movement, change in inspiration and willpower",
      "meaning_rev": "Reversed movement, change in inspiration and willpower",
      "keywords": [
        "movement, change",
        "inspiration",
        "wands"
      ],
      "description": "The Eight of Wands represents speed, momentum, and rapid change. Things are moving quickly and progress is accelerating. It’s a great time for action, communication, and moving forward.",
      "description_up": "Swift progress, movement, and clarity. Events are unfolding rapidly—stay focused and responsive. Ride the wave of momentum.",
      "description_rev": "Delays, miscommunication, or scattered efforts. Things may feel stuck or out of sync. Slow down and reassess your direction."
    },
    {
      "id": 73,
      "name": "Nine of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 9,
      "meaning_up": "Fruition, attainment in inspiration and willpower",
      "meaning_rev": "Reversed fruition, attainment in inspiration and willpower",
      "keywords": [
        "fruition, attainment",
        "inspiration",
        "wands"
      ],
      "description": "The Nine of Wands is about resilience, protection, and the final push before success. You may feel weary, but you are close to achieving your goal. Stay alert and maintain your boundaries.",
      "description_up": "Perseverance, courage, and grit. You’re battle-tested and stronger than you think. Keep going—victory is near.",
      "description_rev": "Fatigue, paranoia, or defensiveness. You may be too guarded or running on empty. Rest and regroup before continuing."
    },
    {
      "id": 74,
      "name": "Ten of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 10,
      "meaning_up": "Completion, fulfillment in inspiration and willpower",
      "meaning_rev": "Reversed completion, fulfillment in inspiration and willpower",
      "keywords": [
        "completion, fulfillment",
        "inspiration",
        "wands"
      ],
      "description": "The Ten of Wands signals burden, stress, and carrying too much. You may be overwhelmed by responsibilities or expectations. It’s a sign to release what no longer serves you.",
      "description_up": "Responsibility, hard work, and obligation. You’ve come far but the load is heavy. Ask for support and prioritize wisely.",
      "description_rev": "Burnout, collapse, or avoidance. You’re at your limit. Lighten the load before it breaks you."
    },
    {
      "id": 75,
      "name": "Page of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 11,
      "meaning_up": "Curiosity, new stage expressed through inspiration and willpower",
      "meaning_rev": "Reversed curiosity, new stage in inspiration and willpower",
      "keywords": [
        "curiosity, new stage",
        "inspiration",
        "wands"
      ],
      "description": "The Page of Wands brings curiosity, adventure, and a youthful spark of energy. It invites exploration and enthusiasm for what’s possible. This card encourages you to stay open to inspiration and discovery.",
      "description_up": "Inspiration, exploration, and fresh ideas. Follow your excitement and don’t be afraid to try something new. This is a time of creative learning.",
      "description_rev": "Impatience, immaturity, or lack of direction. You may be scattered or unsure how to act. Find your footing before rushing ahead."
    },
    {
      "id": 76,
      "name": "Knight of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 12,
      "meaning_up": "Action, pursuit expressed through inspiration and willpower",
      "meaning_rev": "Reversed action, pursuit in inspiration and willpower",
      "keywords": [
        "action, pursuit",
        "inspiration",
        "wands"
      ],
      "description": "The Knight of Wands represents bold action, ambition, and adventurous energy. He charges forward with passion and thrives on challenge. This card encourages confidence—but also warns against recklessness.",
      "description_up": "Boldness, excitement, and drive. You’re fueled by passion and ready to act. Channel this energy wisely for maximum impact.",
      "description_rev": "Impulsiveness, arrogance, or burnout. Acting too quickly can lead to mistakes. Temper enthusiasm with planning."
    },
    {
      "id": 77,
      "name": "Queen of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 13,
      "meaning_up": "Understanding, mastery expressed through inspiration and willpower",
      "meaning_rev": "Reversed understanding, mastery in inspiration and willpower",
      "keywords": [
        "understanding, mastery",
        "inspiration",
        "wands"
      ],
      "description": "The Queen of Wands embodies confidence, charisma, and creative power. She is magnetic and assertive, uplifting others with her presence. This card invites you to own your personal power.",
      "description_up": "Confidence, warmth, and leadership. Stand in your truth and inspire others. You’re in a position of radiant influence.",
      "description_rev": "Insecurity, jealousy, or introversion. You may be doubting your gifts. Reclaim your self-worth and shine."
    },
    {
      "id": 78,
      "name": "King of Wands",
      "arcana": "Minor",
      "suit": "Wands",
      "number": 14,
      "meaning_up": "Authority, control expressed through inspiration and willpower",
      "meaning_rev": "Reversed authority, control in inspiration and willpower",
      "keywords": [
        "authority, control",
        "inspiration",
        "wands"
      ],
      "description": "The King of Wands symbolizes visionary leadership, ambition, and confidence. He acts with authority and integrity, guided by long-term goals. This card encourages you to lead boldly and inspire others.",
      "description_up": "Leadership, vision, and passion. You’re ready to take charge and create lasting impact. Lead with clarity and courage.",
      "description_rev": "Domineering, ego-driven, or impulsive. You might be overstepping or lacking focus. Recalibrate your leadership style."
    }
  ]